{"title":"Reading November 26th, 2017","week":"November 26th, 2017","articles":[{"title":"The Trump-Russia Story Is Coming Together. Here's How to Make Sense of It – BillMoyers.com","date_liked":"November 28, 2017 at 07:05PM","description":"Donald Trump Jr. greets his father during the Oct. 9, 2016 presidential debate in St. Louis. (Photo by Saul Loeb-Pool/Getty Images) Editor’s Note: The news is…","url":"http://billmoyers.com/story/trump-russia-story-coming-together-heres-make-sense/"},{"title":"Film Crit Hulk SMASH: Let’s Talk About “Pickle Rick” | Birth.Movies.Death.","date_liked":"November 29, 2017 at 05:55PM","description":"I watched \"Pickle Rick\" and then I had to go sit outside for awhile. I just had to detach. And I took my time, too. I breathed in the cool night air. I looked…","url":"http://birthmoviesdeath.com/2017/08/08/film-crit-hulk-smash-lets-talk-about-pickle-rick"},{"title":"We Are Unchained Capital – Unchained Capital Blog","date_liked":"November 30, 2017 at 05:10PM","description":"One Simple Way to Unlock your Idle Bitcoin In less than 10 short years Bitcoin has created a new asset class and global financial network using a beautiful…","url":"https://blog.unchained-capital.com/we-are-unchained-capital-bd9ddd37c41d"},{"title":"New Evidence Makes the Uber-Waymo Self-Driving Car Lawsuit Much Nastier | WIRED","date_liked":"November 30, 2017 at 05:17PM","description":"The bruising legal fight between Uber and Waymo over self-driving car tech took another explosive turn today, after the judge overseeing the case discovered…","url":"https://www.wired.com/story/hidden-evidence-uber-waymo-self-driving-car/"},{"title":"D.J.I., the Chinese Drone Maker, Clashes with U.S. Over Data - NYTimes.com","date_liked":"November 30, 2017 at 06:54PM","description":"A drone made by D.J.I. in a demonstration at the company’s headquarters in Shenzhen, China, last year. The company said accusations by the Immigration and…","url":"https://www.nytimes.com/2017/11/29/technology/dji-china-data-drones.html"},{"title":"Mastodon WTF timeline - Ansuz - mskala's home page","date_liked":"November 30, 2017 at 07:07PM","description":"Mastodon WTF timeline Sun 23 Apr 2017 by mskala Tags used: networking , 日本語 , politics , pornography In the last few days I've been fortunate to witness an…","url":"http://ansuz.sooke.bc.ca/entry/335"}]}