{"title":"Reading May 15th, 2016","week":"May 15th, 2016","articles":[{"title":"interfluidity » Difference","date_liked":"May 15, 2016 at 12:47PM","description":"Matt Yglesias, with characteristic perceptiveness, points out (ht DeLong ) that There are significant and salient tension between the economic and…","url":"http://www.interfluidity.com/v2/6451.html","notes":"I think I'm probably a Universalist Liberal just below the x-axis."},{"title":"Chapter 1: The Way Houyhnhnms Compute","date_liked":"May 15, 2016 at 12:58PM","description":"Dear fellow programmer, I used to think humans wrote software the way they did because they knew what they were doing. Then I realized that they didn’t really…","url":"http://ngnghm.github.io/blog/2015/08/02/chapter-1-the-way-houyhnhnms-compute/","notes":"I'm not wild about using design fiction to convey a point of view about computing or user interface (unless you're _why). It often comes off as condescending. This piece certainly does, but the point it makes is a good one."},{"title":"Unnatural Selection: Muscles, Genes and Genetic Cheats","date_liked":"May 15, 2016 at 05:37PM","description":"Credit: Courtesy of PeskyMonkey, via iStockphoto.com Take a close look at the athletes competing in this year's Summer Olympic Games in London —their…","url":"http://www.scientificamerican.com/article/muscles-genes-cheats-2012-olympics-london/"},{"title":"interfluidity » “Incentives to produce” are incentives to rig the game","date_liked":"May 16, 2016 at 08:34AM","description":"That’s obvious, right? But let’s belabor the point. All too often in discussions about the vast dispersion of circumstance we call “inequality”, people concede…","url":"http://www.interfluidity.com/v2/5031.html","notes":"Yes, always. Demand is the incentive to produce. With the exception of inflating a non-existent market, see \"On the Road to Recap\" or the solar industry, supply side incentives are rents to be captured."},{"title":"On the Road to Recap: | Above the Crowd","date_liked":"May 17, 2016 at 09:02AM","description":"April 21, 2016: Why the Unicorn Financing Market Just Became Dangerous…For All Involved In February of last year, Fortune magazine writers Erin Griffith and Dan…","url":"http://abovethecrowd.com/2016/04/21/on-the-road-to-recap/","notes":"Clear explanation of \"the Steroid Era\" of startups. How raising massive amounts of capital could be used as the key competitive tool, especially in two sided marketplaces, and how hard it is to do well. Uber and AirBnB are the best examples of using capital to inflate a marketplace. Buy supply. Then buy demand. Really you buy both simultanesouly but supply needs to lead deamnd slightly. Then buy speed to market and scale. If you don't buy all four you will fail. In an environment where massive amounts of capital can be raised cheaply, being able to raise money and deploy it in this way is the key skill for success."},{"title":"Lessons From a ‘Local Food’ Scam Artist","date_liked":"May 18, 2016 at 06:52PM","description":"I met my first New York foodie over twenty years ago, when I was seventeen, hawking “local bananas” at a roadside produce stand in rural New Jersey. It was my…","url":"http://narrative.ly/lessons-from-a-local-food-scam-artist/"},{"title":"How I Acted Like A Pundit And Screwed Up On Donald Trump","date_liked":"May 18, 2016 at 07:37PM","description":"Since Donald Trump effectively wrapped up the Republican nomination this month, I’ve seen a lot of critical self-assessments from empirically minded journalists…","url":"http://fivethirtyeight.com/features/how-i-acted-like-a-pundit-and-screwed-up-on-donald-trump/","notes":"A nice mea culpa from Nate Silver and the 538 team. Their real sin was pretending like they were modeling Trump in the first place. His candidacy is an outlier event and most models are going to break but they just stated their priors as predictions."},{"title":"How to Plan Your Ideal Day","date_liked":"May 19, 2016 at 11:35AM","description":"“How we spend our days is, of course, how we spend our lives. What we do with this hour and with that one, is what we are doing.” – Annie Dillard How do we do…","url":"http://taylorpearson.me/idealday/","notes":"When I got to the section where he talks about eating the same thing everyday for the last two years I knew this advice wasn't for me. \"Systems over goals\" and setting up habits that encourage the kind of work you want to produce are great ideas, but this approach will not work for me. People that can industrialize their livesin this way are a mystery to me. I've tried creating a routine like this and maintaining consistency consumes all of my energy and drains any energy I might use for creative work. I try and create an environment  that nudges me in the right direction, but where I can still be spontaneous and experience a lot of novelty and variety. I am not good at it. This temperament probably excludes from ever being a great athlete or polymath. "},{"title":"Scientists create 'rewritable magnetic charge ice'","date_liked":"May 20, 2016 at 09:35AM","description":"A depiction of the global order of magnetic charge ice. Orange-red areas represent the positive charges; blue areas represent negative charges. A team of…","url":"https://www.sciencedaily.com/releases/2016/05/160519144533.htm"},{"title":"Heidegger’s Ghosts","date_liked":"May 20, 2016 at 09:46AM","description":"Heidegger has powerful adherents in societies as different as Russia and Iran. If liberal democracies are to reckon with his followers, they must wrestle with…","url":"http://www.the-american-interest.com/2016/02/25/heideggers-ghosts/"}]}