{"title":"Reading July 23rd, 2017","week":"July 23rd, 2017","articles":[{"title":"The ideology of \"the market\"","date_liked":"July 24, 2017 at 02:14PM","description":"One curiosity of the row over top BBC pay has been the attempts of past and present BBC bosses to defend high pay by invoking “the market”. “There is a market…","url":"http://stumblingandmumbling.typepad.com/stumbling_and_mumbling/2017/07/the-ideology-of-the-market.html"},{"title":"How stress works in the human body, to make or break us – Bruce McEwen | Aeon Essays","date_liked":"July 24, 2017 at 02:27PM","description":"Stress pervades our lives. We become anxious when we hear of violence, chaos or discord. And, in our relatively secure world, the pace of life and its demands…","url":"https://aeon.co/essays/how-stress-works-in-the-human-body-to-make-or-break-us"},{"title":"In Game Theory, No Clear Path to Equilibrium | Quanta Magazine","date_liked":"July 26, 2017 at 12:11PM","description":"In 1950, John Nash — the mathematician later featured in the book and film “A Beautiful Mind” — wrote a two-page paper that transformed the theory of economics.…","url":"https://www.quantamagazine.org/in-game-theory-no-clear-path-to-equilibrium-20170718/"},{"title":"Swish, the secret Swedish FinTech payment company created by Nordic banks and used by 50% of Swedes…","date_liked":"July 26, 2017 at 12:17PM","description":"“Just Swish it to me. It is easier and safer than having cash.” That’s what a Swedish friend told me after having dinner when I recently visited Stockholm. When…","url":"https://medium.com/@etiennebr/swish-the-secret-swedish-fintech-payment-company-created-by-nordic-banks-and-used-by-50-of-swedes-cfcf06f59d6f"},{"title":"Monsters, Marvels, and the Birth of Science - Issue 50: Emergence - Nautilus","date_liked":"July 26, 2017 at 12:47PM","description":"F inding regularity in nature is the bread and butter of science. We know that reptiles lay eggs, while mammals bear live young; the Earth revolves around the…","url":"http://nautil.us/issue/50/emergence/monsters-marvels-and-the-birth-of-science-rp"}]}